const experienceList = [
  {
    position: "Frontend-разработчик",
    period: "11/2024г. - наст.время",
    company: "Абак-Пресс",
    project: "Я Покупаю",
    projectLink: "https://www.yapokupayu.ru/",
    city: "Екатеринбург",
    details: [
      "исправление старых ошибок",
      "редизайн отдельных блоков на страницах",
      "реализация новых функциональных блоков",
      "рефакторинг кода",
      "работа с шаблонизаторами erb и haml",
      "взаимодействие с backend- и frontend-разработчиками, тестировщиками и проектным менеджером",
      "выполнение бизнес-задач",
      "ревью Pull requests"
    ]
  },
  {
    position: "Редактор-аналитик",
    period: "05/2018 - 02/2025гг.",
    company: "Медиалогия",
    companyLink: "https://www.mlg.ru/",
    city: "Москва",
    details: [
      "анализ, обработка, сортировка, а также контроль реагирования на поступающие в систему данные",
      "помощь в решении проблем жителей области",
      "разработка и ведение документации по работе в системе",
      {
        sublistTitle: "12/2019 - 06/2021 - руководство отделом модерации",
        subItems: [
          "координация работы отдела модерации",
          "взаимодействие с заказчиком",
          "участие в брейн штормах",
          "ручное тестирование нового функционала",
          "реализовано более 9 поставленных мною задач по доработке функционала системы",
          "обучила 5 сотрудников"
        ]
      }
    ]
  },
  {
    position: "Контент-редактор",
    period: "06/2015 - 02/2018гг.",
    company: "Абак-Пресс",
    project: "Близко.ру",
    projectLink: "https://blizko.ru/",
    city: "Екатеринбург",
    details: [
      "создание сайтов для клиентов на собственной платформе Blizko.ru, наполнение контентом",
      "сопровождение клиентов по телефону (консультирование, помощь, отчет о проделанной работе)"
    ]
  }
];

export default experienceList;
