const experienceList = [
  {
    position: "Frontend-разработчик",
    period: {
      start: "2024-11",
      end: null,
    },
    company: "Медиахолдинг Абак-Пресс",
    project: "Я Покупаю",
    projectLink: "https://www.yapokupayu.ru/",
    city: "Екатеринбург",
    details: [
      "Разработка и поддержка интерфейса на React, TypeScript, JavaScript",
      "Ответственность за репозиторий проекта",
      "Обучение и сопровождение нового разработчика на проекте",
      "Интеграция фронтенда с серверной частью через REST API",
      "Участие в проектировании API совместно с backend-разработчиками",
      "Проектирование и декомпозиция задач, участие в оценке сроков",
      "Code review, контроль качества кода",
      "Реализация новых фич по дизайн-макетам (Figma) и поддержка существующего функционала",
      "Работа с легаси-кодом без нарушения связанной логики",
      "Рефакторинг и оптимизация существующего кода",
      "Оптимизация производительности и метрик загрузки (LCP, CLS, INP / TBT)",
      "Улучшение UI/UX, редизайн отдельных блоков",
      "Работа с состояниями загрузки и ошибок",
      "Исправление багов по результатам QA и пользовательской обратной связи",
      "Настройка и поддержка ESLint, Prettier",
      "Написание unit-тестов на Jest",
      "Внедрила React on Rails для улучшения взаимодействия фронтенда с бэкендом и решения SEO проблем",
    ],
  },
  {
    position: "Редактор-аналитик / Руководитель отдела модерации",
    period: {
      start: "2018-05",
      end: "2025-02",
    },
    company: "Медиалогия",
    companyLink: "https://www.mlg.ru/",
    city: "Москва",
    details: [
      "Анализ, обработка и контроль больших объёмов данных",
      "Взаимодействие с заказчиками и внутренними командами",
      "Руководство отделом модерации (до 13 человек)",
      "Постановка задач, контроль сроков, обучение сотрудников",
      "Организация и планирование рабочего процесса",
      "Разработка и ведение документации",
      "Участие в тестировании нового функционала",
      "Участие в брейн штормах",
    ],
  },
];

export default experienceList;
